app/controllers/courses_controller.rb

  def index
    @courses= current_school.courses.all
    @courses=current_school.courses.paginate(:page => params[:page], :per_page => 10)
---
SELECT `courses`.* FROM `courses`
SELECT  `courses`.* FROM `courses` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `courses`

  def create
    @course = current_school.courses.build(course_params)
    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`title`, `author`, `created_at`, `updated_at`) VALUES ('Ruby On Rails', 'Ariful Islam', '2017-03-23 17:29:31', '2017-03-23 17:29:31')