app/controllers/course_klass_lists_controller.rb

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1
INSERT INTO `course_klass_lists` (`course_id`, `klass_id`, `created_at`, `updated_at`) VALUES (2, 3, '2017-03-23 18:47:37', '2017-03-23 18:47:37')
INSERT INTO `klasses` (`created_at`, `updated_at`) VALUES ('2017-03-23 18:47:36', '2017-03-23 18:47:36')
---
  def create
    @klass=current_klass
    course= Course.find(params[:course_id])
    @course_klass_list= @klass.course_klass_lists.build(:course => course)
    respond_to do |format|
      if @course_klass_list.save

SELECT  `course_klass_lists`.* FROM `course_klass_lists` WHERE `course_klass_lists`.`id` = 2 LIMIT 1
---
  def set_course_klass_list
    @course_klass_list = CourseKlassList.find(params[:id])