app/controllers/klasses_controller.rb

SELECT `klasses`.* FROM `klasses`
---
  def index
    @klasses= Klass.all

INSERT INTO `klasses` (`time`, `course`, `room_no`, `place`, `teacher`, `email`, `duration`, `created_at`, `updated_at`) VALUES ('2000-01-01 03:03:00.000000', 'Fame Is the Spur', 320, 'Dhaka', 'md. Ariful Islam', 'gmarifulislamarif@gmail.com', '2000-01-01 01:30:01.000000', '2017-03-23 19:18:49', '2017-03-23 19:18:49')
---
  def create
    #course=Course.find(params[:course_id])
    @klass =current_school.course.klasses.build(klass_params)
    respond_to do |format|
      if @klass.save

UPDATE `klasses` SET `course` = 'Rosemary Sutcliff', `email` = 'gmarifulislamarif@gmail.com', `updated_at` = '2017-03-23 19:58:41' WHERE `klasses`.`id` = 1
---
  def update
    respond_to do |format|
      if @klass.update(klass_params)

DELETE FROM `klasses` WHERE `klasses`.`id` = 3
---
  def destroy
    @klass.destroy

SELECT  `klasses`.* FROM `klasses` WHERE `klasses`.`id` = 3 LIMIT 1
---
  def set_klass
    @klass = Klass.find(params[:id])