app/controllers/schools_controller.rb

  def create
    @school = School.new(school_params)
    respond_to do |format|
      if @school.save
---
INSERT INTO `schools` (`name`, `address`, `registration_no`, `country`, `admin`, `email`, `mobile`, `created_at`, `updated_at`) VALUES ('E-school', 'Block-C, Road-10, House-11, Mirpur-12, Dhaka.', '12345', 'Bangladesh', 'Md. Ariful Islam', 'gmarifulislamarif@gmail.com', '01914840253', '2017-03-24 03:12:22', '2017-03-24 03:12:22')

  def set_school
    @school = School.find(params[:id])
---
SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 0 LIMIT 1