app/views/klasses/_form.html.erb

      <%= f.label :course %>
      <%= f.select :course, Course::COURSE_NAMES,prompt:'Select a Course', class: 'form-control'%>
---
SELECT `courses`.* FROM `courses`